sep = ''

#Create Alphabet Class
class Alphabet:
    def __init__(self, chosenAlphabet):
        self.alphabet = chosenAlphabet
    def change(self, text):
        splitString = list(text)
        output = []
        for character in splitString:
            if character == " " or character == "_" or character == "." or character == "," or character == ":" or character == "?" or character == "(" or character == ")":
                output.append(character)
            else:
                output.append(self.alphabet[normalAlphabet.index(character)])
        return output

#Alphabets
normalAlphabet = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', ' ']
gothic = Alphabet(['𝔞', '𝔟', '𝔠', '𝔡', '𝔢', '𝔣', '𝔤', '𝔥', '𝔦', '𝔧', '𝔨', '𝔩', '𝔪', '𝔫', '𝔬', '𝔭', '𝔮', '𝔯', '𝔰', '𝔱', '𝔲', '𝔳', '𝔴', '𝔵', '𝔶', '𝔷', '𝔄', '𝔅', 'ℭ', '𝔇', '𝔈', '𝔉', '𝔊', 'ℌ', 'ℑ', '𝔍', '𝔎', '𝔏', '𝔐', '𝔑', '𝔒', '𝔓', '𝔔', 'ℜ', '𝔖', '𝔗', '𝔘', '𝔙', '𝔚', '𝔛', '𝔜', 'ℨ'])
circle = Alphabet(['ⓐ', 'ⓑ', 'ⓒ', 'ⓓ', 'ⓔ', 'ⓕ', 'ⓖ', 'ⓗ', 'ⓘ', 'ⓙ', 'ⓚ', 'ⓛ', 'ⓜ', 'ⓝ', 'ⓞ', 'ⓟ', 'ⓠ', 'ⓡ', 'ⓢ', 'ⓣ', 'ⓤ', 'ⓥ', 'ⓦ', 'ⓧ', 'ⓨ', 'ⓩ', 'Ⓐ', 'Ⓑ', 'Ⓒ', 'Ⓓ', 'Ⓔ', 'Ⓕ', 'Ⓖ', 'Ⓗ', 'Ⓘ', 'Ⓙ', 'Ⓚ', 'Ⓛ', 'Ⓜ', 'Ⓝ', 'Ⓞ', 'Ⓟ', 'Ⓠ', 'Ⓡ', 'Ⓢ', 'Ⓣ', 'Ⓤ', 'Ⓥ', 'Ⓦ', 'Ⓧ', 'Ⓨ', 'Ⓩ', ' '])
negCircle = Alphabet(['🅐', '🅑', '🅒', '🅓', '🅔', '🅕', '🅖', '🅗', '🅘', '🅙', '🅚', '🅛', '🅜', '🅝', '🅞', '🅟', '🅠', '🅡', '🅢', '🅣', '🅤', '🅥', '🅦', '🅧', '🅨', '🅩', '🅐', '🅑', '🅒', '🅓', '🅔', '🅕', '🅖', '🅗', '🅘', '🅙', '🅚', '🅛', '🅜', '🅝', '🅞', '🅟', '🅠', '🅡', '🅢', '🅣', '🅤', '🅥', '🅦', '🅧', '🅨', '🅩', ' '])
monospace = Alphabet(['𝚊', '𝚋', '𝚌', '𝚍', '𝚎', '𝚏', '𝚐', '𝚑', '𝚒', '𝚓', '𝚔', '𝚕', '𝚖', '𝚗', '𝚘', '𝚙', '𝚚', '𝚛', '𝚜', '𝚝', '𝚞', '𝚟', '𝚠', '𝚡', '𝚢', '𝚣', '𝙰', '𝙱', '𝙲', '𝙳', '𝙴', '𝙵', '𝙶', '𝙷', '𝙸', '𝙹', '𝙺', '𝙻', '𝙼', '𝙽', '𝙾', '𝙿', '𝚀', '𝚁', '𝚂', '𝚃', '𝚄', '𝚅', '𝚆', '𝚇', '𝚈', '𝚉', ' '])
doublestuck = Alphabet(['𝕒', '𝕓', '𝕔', '𝕕', '𝕖', '𝕗', '𝕘', '𝕙', '𝕚', '𝕛', '𝕜', '𝕝', '𝕞', '𝕟', '𝕠', '𝕡', '𝕢', '𝕣', '𝕤', '𝕥', '𝕦', '𝕧', '𝕨', '𝕩', '𝕪', '𝕫', '𝔸', '𝔹', 'ℂ', '𝔻', '𝔼', '𝔽', '𝔾', 'ℍ', '𝕀', '𝕁', '𝕂', '𝕃', '𝕄', 'ℕ', '𝕆', 'ℙ', 'ℚ', 'ℝ', '𝕊', '𝕋', '𝕌', '𝕍', '𝕎', '𝕏', '𝕐', 'ℤ', ' '])
cursive = Alphabet(['𝒶', '𝒷', '𝒸', '𝒹', 'ℯ', '𝒻', 'ℊ', '𝒽', '𝒾', '𝒿', '𝓀', '𝓁', '𝓂', '𝓃', 'ℴ', '𝓅', '𝓆', '𝓇', '𝓈', '𝓉', '𝓊', '𝓋', '𝓌', '𝓍', '𝓎', '𝓏', '𝒜', 'ℬ', '𝒞', '𝒟', 'ℰ', 'ℱ', '𝒢', 'ℋ', 'ℐ', '𝒥', '𝒦', 'ℒ', 'ℳ', '𝒩', '𝒪', '𝒫', '𝒬', 'ℛ', '𝒮', '𝒯', '𝒰', '𝒱', '𝒲', '𝒳', '𝒴', '𝒵', ' '])
squared = Alphabet(['🄰', '🄱', '🄲', '🄳', '🄴', '🄵', '🄶', '🄷', '🄸', '🄹', '🄺', '🄻', '🄼', '🄽', '🄾', '🄿', '🅀', '🅁', '🅂', '🅃', '🅄', '🅅', '🅆', '🅇', '🅈', '🅉', '🄰', '🄱', '🄲', '🄳', '🄴', '🄵', '🄶', '🄷', '🄸', '🄹', '🄺', '🄻', '🄼', '🄽', '🄾', '🄿', '🅀', '🅁', '🅂', '🅃', '🅄', '🅅', '🅆', '🅇', '🅈', '🅉', ' '])
negSquared = Alphabet(['🅰', '🅱', '🅲', '🅳', '🅴', '🅵', '🅶', '🅷', '🅸', '🅹', '🅺', '🅻', '🅼', '🅽', '🅾', '🅿', '🆀', '🆁', '🆂', '🆃', '🆄', '🆅', '🆆', '🆇', '🆈', '🆉', '🅰', '🅱', '🅲', '🅳', '🅴', '🅵', '🅶', '🅷', '🅸', '🅹', '🅺', '🅻', '🅼', '🅽', '🅾', '🅿', '🆀', '🆁', '🆂', '🆃', '🆄', '🆅', '🆆', '🆇', '🆈', '🆉', ' '])
serif = Alphabet(['𝐚', '𝐛', '𝐜', '𝐝', '𝐞', '𝐟', '𝐠', '𝐡', '𝐢', '𝐣', '𝐤', '𝐥', '𝐦', '𝐧', '𝐨', '𝐩', '𝐪', '𝐫', '𝐬', '𝐭', '𝐮', '𝐯', '𝐰', '𝐱', '𝐲', '𝐳', '𝐀', '𝐁', '𝐂', '𝐃', '𝐄', '𝐅', '𝐆', '𝐇', '𝐈', '𝐉', '𝐊', '𝐋', '𝐌', '𝐍', '𝐎', '𝐏', '𝐐', '𝐑', '𝐒', '𝐓', '𝐔', '𝐕', '𝐖', '𝐗', '𝐘', '𝐙', ' '])
curvy = Alphabet(['ᗩ', 'ᗷ', 'ᑕ', 'ᗪ', 'E', 'ᖴ', 'G', 'ᕼ', 'I', 'ᒍ', 'K', 'ᒪ', 'ᗰ', 'ᑎ', 'O', 'ᑭ', 'ᑫ', 'ᖇ', 'ᔕ', 'T', 'ᑌ', 'ᐯ', 'ᗯ', '᙭', 'Y', 'ᘔ', 'ᗩ', 'ᗷ', 'ᑕ', 'ᗪ', 'E', 'ᖴ', 'G', 'ᕼ', 'I', 'ᒍ', 'K', 'ᒪ', 'ᗰ', 'ᑎ', 'O', 'ᑭ', 'ᑫ', 'ᖇ', 'ᔕ', 'T', 'ᑌ', 'ᐯ', 'ᗯ', '᙭', 'Y', 'ᘔ'])
boxed = Alphabet(['[̲̅a]', '[̲̅b]', '[̲̅c]', '[̲̅d]', '[̲̅e]', '[̲̅f]', '[̲̅g]', '[̲̅h]', '[̲̅i]', '[̲̅j]', '[̲̅k]', '[̲̅l]', '[̲̅m]', '[̲̅n]', '[̲̅o]', '[̲̅p]', '[̲̅q]', '[̲̅r]', '[̲̅s]', '[̲̅t]', '[̲̅u]', '[̲̅v]', '[̲̅w]', '[̲̅x]', '[̲̅y]', '[̲̅z]', '[̲̅A]', '[̲̅B]', '[̲̅C]', '[̲̅D]', '[̲̅E]', '[̲̅F]', '[̲̅G]', '[̲̅H]', '[̲̅I]', '[̲̅J]', '[̲̅K]', '[̲̅L]', '[̲̅M]', '[̲̅N]', '[̲̅O]', '[̲̅P]', '[̲̅Q]', '[̲̅R]', '[̲̅S]', '[̲̅T]', '[̲̅U]', '[̲̅V]', '[̲̅W]', '[̲̅X]', '[̲̅Y]', '[̲̅Z]'])
fancyBoxed = Alphabet(['『a』', '『b』', '『c』', '『d』', '『e』', '『f』', '『g』', '『h』', '『i』', '『j』', '『k』', '『l』', '『m』', '『n』', '『o』', '『p』', '『q』', '『r』', '『s』', '『t』', '『u』', '『v』', '『w』', '『x』', '『y』', '『z』', '『A』', '『B』', '『C』', '『D』', '『E』', '『F』', '『G』', '『H』', '『I』', '『J』', '『K』', '『L』', '『M』', '『N』', '『O』', '『P』', '『Q』', '『R』', '『S』', '『T』', '『U』', '『V』', '『W』', '『X』', '『Y』', '『Z』'])
weird = Alphabet(['ค', '๒', 'ς', '๔', 'є', 'Ŧ', 'ﻮ', 'ђ', 'เ', 'ן', 'к', 'ɭ', '๓', 'ภ', '๏', 'ק', 'ợ', 'г', 'ร', 'Շ', 'ย', 'ש', 'ฬ', 'א', 'ץ', 'չ', 'ค', '๒', 'ς', '๔', 'є', 'Ŧ', 'ﻮ', 'ђ', 'เ', 'ן', 'к', 'ɭ', '๓', 'ภ', '๏', 'ק', 'ợ', 'г', 'ร', 'Շ', 'ย', 'ש', 'ฬ', 'א', 'ץ', 'չ'])
struck = Alphabet(['₳', '฿', '₵', 'Đ', 'Ɇ', '₣', '₲', 'Ⱨ', 'ł', 'J', '₭', 'Ⱡ', '₥', '₦', 'Ø', '₱', 'Q', 'Ɽ', '₴', '₮', 'Ʉ', 'V', '₩', 'Ӿ', 'Ɏ', 'Ⱬ', '₳', '฿', '₵', 'Đ', 'Ɇ', '₣', '₲', 'Ⱨ', 'ł', 'J', '₭', 'Ⱡ', '₥', '₦', 'Ø', '₱', 'Q', 'Ɽ', '₴', '₮', 'Ʉ', 'V', '₩', 'Ӿ', 'Ɏ', 'Ⱬ'])
asian = Alphabet(['卂', '乃', '匚', 'ᗪ', '乇', '千', 'Ꮆ', '卄', '丨', 'ﾌ', 'Ҝ', 'ㄥ', '爪', '几', 'ㄖ', '卩', 'Ɋ', '尺', '丂', 'ㄒ', 'ㄩ', 'ᐯ', '山', '乂', 'ㄚ', '乙', '卂', '乃', '匚', 'ᗪ', '乇', '千', 'Ꮆ', '卄', '丨', 'ﾌ', 'Ҝ', 'ㄥ', '爪', '几', 'ㄖ', '卩', 'Ɋ', '尺', '丂', 'ㄒ', 'ㄩ', 'ᐯ', '山', '乂', 'ㄚ', '乙'])
circleBox = Alphabet(['【a】', '【b】', '【c】', '【d】', '【e】', '【f】', '【g】', '【h】', '【i】', '【j】', '【k】', '【l】', '【m】', '【n】', '【o】', '【p】', '【q】', '【r】', '【s】', '【t】', '【u】', '【v】', '【w】', '【x】', '【y】', '【z】', '【A】', '【B】', '【C】', '【D】', '【E】', '【F】', '【G】', '【H】', '【I】', '【J】', '【K】', '【L】', '【M】', '【N】', '【O】', '【P】', '【Q】', '【R】', '【S】', '【T】', '【U】', '【V】', '【W】', '【X】', '【Y】', '【Z】'])
wavy = Alphabet(['≋a≋', '≋b≋', '≋c≋', '≋d≋', '≋e≋', '≋f≋', '≋g≋', '≋h≋', '≋i≋', '≋j≋', '≋k≋', '≋l≋', '≋m≋', '≋n≋', '≋o≋', '≋p≋', '≋q≋', '≋r≋', '≋s≋', '≋t≋', '≋u≋', '≋v≋', '≋w≋', '≋x≋', '≋y≋', '≋z≋', '≋A≋', '≋B≋', '≋C≋', '≋D≋', '≋E≋', '≋F≋', '≋G≋', '≋H≋', '≋I≋', '≋J≋', '≋K≋', '≋L≋', '≋M≋', '≋N≋', '≋O≋', '≋P≋', '≋Q≋', '≋R≋', '≋S≋', '≋T≋', '≋U≋', '≋V≋', '≋W≋', '≋X≋', '≋Y≋', '≋Z≋'])
grid = Alphabet(['░a░', '░b░', '░c░', '░d░', '░e░', '░f░', '░g░', '░h░', '░i░', '░j░', '░k░', '░l░', '░m░', '░n░', '░o░', '░p░', '░q░', '░r░', '░s░', '░t░', '░u░', '░v░', '░w░', '░x░', '░y░', '░z░', '░A░', '░B░', '░C░', '░D░', '░E░', '░F░', '░G░', '░H░', '░I░', '░J░', '░K░', '░L░', '░M░', '░N░', '░O░', '░P░', '░Q░', '░R░', '░S░', '░T░', '░U░', '░V░', '░W░', '░X░', '░Y░', '░Z░'])
rustify = Alphabet(['а', 'б', 'c', 'д', 'ё', 'f', 'g', 'н', 'ї', 'j', 'к', 'г', 'ѫ', 'п', 'ѳ', 'p', 'ф', 'я', '$', 'т', 'ц', 'ѵ', 'щ', 'ж', 'ч', 'з', 'А', 'Б', 'C', 'Д', 'Є', 'F', 'G', 'H', 'Ї', 'J', 'К', 'Г', 'Ѫ', 'Й', 'Ѳ', 'P', 'Ф', 'Я', '$', 'T', 'Ц', 'Ш', 'Ж', 'Ч', 'З'])
symbols = Alphabet(['ꍏ', '♭', '☾', '◗', '€', 'Ϝ', '❡', '♄', '♗', '♪', 'ϰ', '↳', '♔', '♫', '⊙', 'ρ', '☭', '☈', 'ⓢ', '☂', '☋', '✓', 'ω', '⌘', '☿', '☡', 'ꍏ', '♭', '☾', '◗', '€', 'Ϝ', '❡', '♄', '♗', '♪', 'ϰ', '↳', '♔', '♫', '⊙', 'ρ', '☭', '☈', 'ⓢ', '☂', '☋', 'ω', '⌘', '☿', '☡'])
strokes = Alphabet(['ꋫ', 'ꃃ', 'ꏸ', 'ꁕ', 'ꍟ', 'ꄘ', 'ꁍ', 'ꑛ', 'ꂑ', 'ꀭ', 'ꀗ', '꒒', 'ꁒ', 'ꁹ', 'ꆂ', 'ꉣ', 'ꁸ', '꒓', 'ꌚ', '꓅', 'ꐇ', 'ꏝ', 'ꅐ', 'ꇓ', 'ꐟ', 'ꁴ', 'ꋫ', 'ꃃ', 'ꏸ', 'ꁕ', 'ꍟ', 'ꄘ', 'ꁍ', 'ꑛ', 'ꂑ', 'ꀭ', 'ꀗ', '꒒', 'ꁒ', 'ꁹ', 'ꆂ', 'ꉣ', 'ꁸ', '꒓', 'ꌚ', '꓅', 'ꐇ', 'ꅐ', 'ꇓ', 'ꐟ', 'ꁴ'])
heiroglyph = Alphabet(['ꋬ', 'ꍗ', 'ꏳ', 'ꂟ', 'ꏂ', 'ꄟ', 'ꍌ', 'ꃬ', '꒐', '꒻', 'ꀘ', '꒒', 'ꂵ', 'ꂚ', 'ꉻ', 'ꉣ', 'ꋠ', 'ꋪ', 'ꑄ', '꓄', 'ꀎ', '꒦', 'ꅐ', 'ꉼ', 'ꐞ', 'ꑓ', 'ꋬ', 'ꍗ', 'ꏳ', 'ꂟ', 'ꏂ', 'ꄟ', 'ꍌ', 'ꃬ', '꒐', '꒻', 'ꀘ', '꒒', 'ꂵ', 'ꂚ', 'ꉻ', 'ꉣ', 'ꋠ', 'ꋪ', 'ꑄ', '꓄', 'ꀎ', 'ꅐ', 'ꉼ', 'ꐞ', 'ꑓ'])
italic = Alphabet(['𝘢', '𝘣', '𝘤', '𝘥', '𝘦', '𝘧', '𝘨', '𝘩', '𝘪', '𝘫', '𝘬', '𝘭', '𝘮', '𝘯', '𝘰', '𝘱', '𝘲', '𝘳', '𝘴', '𝘵', '𝘶', '𝘷', '𝘸', '𝘹', '𝘺', '𝘻', '𝘈', '𝘉', '𝘊', '𝘋', '𝘌', '𝘍', '𝘎', '𝘏', '𝘐', '𝘑', '𝘒', '𝘓', '𝘔', '𝘕', '𝘖', '𝘗', '𝘘', '𝘙', '𝘚', '𝘛', '𝘜', '𝘞', '𝘟', '𝘠', '𝘡'])
bold = Alphabet(['𝐚', '𝐛', '𝐜', '𝐝', '𝐞', '𝐟', '𝐠', '𝐡', '𝐢', '𝐣', '𝐤', '𝐥', '𝐦', '𝐧', '𝐨', '𝐩', '𝐪', '𝐫', '𝐬', '𝐭', '𝐮', '𝐯', '𝐰', '𝐱', '𝐲', '𝐳', '𝐀', '𝐁', '𝐂', '𝐃', '𝐄', '𝐅', '𝐆', '𝐇', '𝐈', '𝐉', '𝐊', '𝐋', '𝐌', '𝐍', '𝐎', '𝐏', '𝐐', '𝐑', '𝐒', '𝐓', '𝐔', '𝐖', '𝐗', '𝐘', '𝐙'])
sorcerer = Alphabet(['ǟ', 'ɮ', 'ƈ', 'ɖ', 'ɛ', 'ʄ', 'ɢ', 'ɦ', 'ɨ', 'ʝ', 'ӄ', 'ʟ', 'ʍ', 'ռ', 'օ', 'ք', 'զ', 'ʀ', 'ֆ', 'ȶ', 'ʊ', 'ʋ', 'ա', 'Ӽ', 'ʏ', 'ʐ', 'ǟ', 'ɮ', 'ƈ', 'ɖ', 'ɛ', 'ʄ', 'ɢ', 'ɦ', 'ɨ', 'ʝ', 'ӄ', 'ʟ', 'ʍ', 'ռ', 'օ', 'ք', 'զ', 'ʀ', 'ֆ', 'ȶ', 'ʊ', 'ա', 'Ӽ', 'ʏ', 'ʐ'])
number = Alphabet(['4', '8', '(', 'd', '3', 'f', '9', 'h', '!', 'j', 'k', '1', 'm', 'n', '0', 'p', 'q', 'r', '5', '7', 'u', 'v', 'w', 'x', 'y', '2', '4', '8', '(', 'D', '3', 'F', '9', 'H', '!', 'J', 'K', '1', 'M', 'N', '0', 'P', 'Q', 'R', '5', '7', 'U', 'W', 'X', 'Y', '2'])
small = Alphabet(['ᵃ', 'ᵇ', 'ᶜ', 'ᵈ', 'ᵉ', 'ᶠ', 'ᵍ', 'ʰ', 'ⁱ', 'ʲ', 'ᵏ', 'ˡ', 'ᵐ', 'ⁿ', 'ᵒ', 'ᵖ', 'q', 'ʳ', 'ˢ', 'ᵗ', 'ᵘ', 'ᵛ', 'ʷ', 'ˣ', 'ʸ', 'ᶻ', 'ᴬ', 'ᴮ', 'ᶜ', 'ᴰ', 'ᴱ', 'ᶠ', 'ᴳ', 'ᴴ', 'ᴵ', 'ᴶ', 'ᴷ', 'ᴸ', 'ᴹ', 'ᴺ', 'ᴼ', 'ᴾ', 'Q', 'ᴿ', 'ˢ', 'ᵀ', 'ᵁ', 'ⱽ', 'ᵂ', 'ˣ', 'ʸ', 'ᶻ'])
upsidedown = Alphabet(['ɐ', 'b', 'ɔ', 'd', 'ǝ', 'ɟ', 'ƃ', 'ɥ', 'ı', 'ɾ', 'ʞ', 'l', 'ɯ', 'n', 'o', 'd', 'b', 'ɹ', 's', 'ʇ', 'n', 'ʌ', 'ʍ', 'x', 'ʎ', 'z', 'ɐ', 'q', 'ɔ', 'p', 'ǝ', 'ɟ', 'ƃ', 'ɥ', 'ı', 'ɾ', 'ʞ', 'l', 'ɯ', 'u', 'o', 'd', 'b', 'ɹ', 's', 'ʇ', 'n', 'ʌ', 'ʍ', 'x', 'ʎ', 'z'])

#Convert Normal Text To Styled Text
def convertText(text):
        try:
            result = [
                sep.join(gothic.change(text)),
                sep.join(circle.change(text)),
                sep.join(negCircle.change(text)),
                sep.join(monospace.change(text)),
                sep.join(doublestuck.change(text)),
                sep.join(cursive.change(text)),
                sep.join(squared.change(text)),
                sep.join(negSquared.change(text)),
                sep.join(serif.change(text)),
                sep.join(curvy.change(text)),
                sep.join(boxed.change(text)),
                sep.join(fancyBoxed.change(text)),
                sep.join(weird.change(text)),
                sep.join(struck.change(text)),
                sep.join(asian.change(text)),
                sep.join(circleBox.change(text)),
                sep.join(wavy.change(text)),
                sep.join(grid.change(text)),
                sep.join(rustify.change(text)),
                sep.join(symbols.change(text)),
                sep.join(strokes.change(text)),
                sep.join(heiroglyph.change(text)),
                sep.join(italic.change(text)),
                sep.join(bold.change(text)),
                sep.join(sorcerer.change(text)),
                sep.join(number.change(text)),
                sep.join(small.change(text)),
                sep.join(upsidedown.change(text))
            ]
            return result
        except:
            return "error"